; domain
(define (domain whispers-of-the-hollow-moon)
  (:requirements :strips :typing)
  (:types
    agent location sigil
  )

  (:constants
    astral-chime somniari-crest mirror-shard noctis-tear - sigil
  )

  (:predicates
    (at ?a - agent ?l - location)
    (path ?from - location ?to - location)
    (has-sigil ?s - sigil)
    (sigil-is-at ?s - sigil ?l - location)
    (can-reclaim ?s - sigil)
    (ritual-site ?l - location)
    (ritual-performed)
    (puzzle-decoded-at ?l - location)
    (mirrorkin-faced-at ?l - location)
    (identity-eroded)
    (identity-secured)
  )

  (:action travel
    :parameters (?a - agent ?from - location ?to - location)
    :precondition (and
      (at ?a ?from)
      (path ?from ?to)
    )
    :effect (and
      (not (at ?a ?from))
      (at ?a ?to)
    )
  )

  (:action decode-memory-puzzle
    :parameters (?a - agent ?l - location)
    :precondition (and
      (at ?a ?l)
      (not (puzzle-decoded-at ?l))
    )
    :effect (and
      (puzzle-decoded-at ?l)
    )
  )

  (:action face-mirrorkin
    :parameters (?a - agent ?l - location)
    :precondition (and
      (at ?a ?l)
      (not (mirrorkin-faced-at ?l))
    )
    :effect (and
      (mirrorkin-faced-at ?l)
    )
  )

  (:action reclaim-sigil
    :parameters (?a - agent ?s - sigil ?l - location)
    :precondition (and
      (at ?a ?l)
      (sigil-is-at ?s ?l)
      (can-reclaim ?s)
      (puzzle-decoded-at ?l)
    )
    :effect (and
      (has-sigil ?s)
      (not (sigil-is-at ?s ?l))
    )
  )

  (:action resist-sleep-decay
    :parameters (?a - agent)
    :precondition (and
      (identity-eroded)
    )
    :effect (and
      (not (identity-eroded))
      (identity-secured)
    )
  )

  (:action perform-lunar-sealing
    :parameters (?a - agent ?l - location)
    :precondition (and
      (at ?a ?l)
      (ritual-site ?l)
      (identity-secured)
      (has-sigil astral-chime)
      (has-sigil somniari-crest)
      (has-sigil mirror-shard)
      (has-sigil noctis-tear)
    )
    :effect (and
      (ritual-performed)
    )
  )
)

; problem
(define (problem hollow-moon-quest)
  (:domain whispers-of-the-hollow-moon)
  (:objects
    dreambound - agent
    waking-marshes temple-of-memory temple-of-mirrors temple-of-slumber temple-of-echoes skyvault-cradle - location
  )

  (:init
    (at dreambound waking-marshes)
    (identity-eroded)

    (can-reclaim astral-chime)
    (can-reclaim somniari-crest)
    (can-reclaim mirror-shard)
    (can-reclaim noctis-tear)

    (sigil-is-at astral-chime temple-of-memory)
    (sigil-is-at somniari-crest temple-of-mirrors)
    (sigil-is-at mirror-shard temple-of-slumber)
    (sigil-is-at noctis-tear temple-of-echoes)

    (ritual-site skyvault-cradle)

    (path waking-marshes temple-of-memory)
    (path temple-of-memory waking-marshes)
    (path waking-marshes temple-of-mirrors)
    (path temple-of-mirrors waking-marshes)
    (path waking-marshes skyvault-cradle)

    (path temple-of-memory temple-of-slumber)
    (path temple-of-slumber temple-of-memory)
    (path temple-of-mirrors temple-of-echoes)
    (path temple-of-echoes temple-of-mirrors)

    (path temple-of-slumber skyvault-cradle)
    (path temple-of-echoes skyvault-cradle)
  )

  (:goal (and
    (ritual-performed)
  ))
)

; plan
1. (resist-sleep-decay dreambound)
   deleted: (identity-eroded)
   added: (identity-secured)
   goals met: 0 of 1
2. (travel dreambound waking-marshes temple-of-mirrors)
   deleted: (at dreambound waking-marshes)
   added: (at dreambound temple-of-mirrors)
   goals met: 0 of 1
3. (decode-memory-puzzle dreambound temple-of-mirrors)
   added: (puzzle-decoded-at temple-of-mirrors)
   goals met: 0 of 1
4. (reclaim-sigil dreambound somniari-crest temple-of-mirrors)
   deleted: (sigil-is-at somniari-crest temple-of-mirrors)
   added: (has-sigil somniari-crest)
   goals met: 0 of 1
5. (travel dreambound temple-of-mirrors temple-of-echoes)
   deleted: (at dreambound temple-of-mirrors)
   added: (at dreambound temple-of-echoes)
   goals met: 0 of 1
6. (decode-memory-puzzle dreambound temple-of-echoes)
   added: (puzzle-decoded-at temple-of-echoes)
   goals met: 0 of 1
7. (reclaim-sigil dreambound noctis-tear temple-of-echoes)
   deleted: (sigil-is-at noctis-tear temple-of-echoes)
   added: (has-sigil noctis-tear)
   goals met: 0 of 1
8. (travel dreambound temple-of-echoes temple-of-mirrors)
   deleted: (at dreambound temple-of-echoes)
   added: (at dreambound temple-of-mirrors)
   goals met: 0 of 1
9. (travel dreambound temple-of-mirrors waking-marshes)
   deleted: (at dreambound temple-of-mirrors)
   added: (at dreambound waking-marshes)
   goals met: 0 of 1
10. (travel dreambound waking-marshes temple-of-memory)
   deleted: (at dreambound waking-marshes)
   added: (at dreambound temple-of-memory)
   goals met: 0 of 1
11. (decode-memory-puzzle dreambound temple-of-memory)
   added: (puzzle-decoded-at temple-of-memory)
   goals met: 0 of 1
12. (reclaim-sigil dreambound astral-chime temple-of-memory)
   deleted: (sigil-is-at astral-chime temple-of-memory)
   added: (has-sigil astral-chime)
   goals met: 0 of 1
13. (travel dreambound temple-of-memory temple-of-slumber)
   deleted: (at dreambound temple-of-memory)
   added: (at dreambound temple-of-slumber)
   goals met: 0 of 1
14. (decode-memory-puzzle dreambound temple-of-slumber)
   added: (puzzle-decoded-at temple-of-slumber)
   goals met: 0 of 1
15. (reclaim-sigil dreambound mirror-shard temple-of-slumber)
   deleted: (sigil-is-at mirror-shard temple-of-slumber)
   added: (has-sigil mirror-shard)
   goals met: 0 of 1
16. (travel dreambound temple-of-slumber skyvault-cradle)
   deleted: (at dreambound temple-of-slumber)
   added: (at dreambound skyvault-cradle)
   goals met: 0 of 1
17. (perform-lunar-sealing dreambound skyvault-cradle)
   added: (ritual-performed)
   goals met: 1 of 1
